import * as ws from "wordsearch";

ws.config_console_panic()

let lista_primeiro_semestre = ["автобус", "автор", "алло", "америка", "арбуз", "арка", "атака", "бабушка", "балерина", "банан", "банк", "бар", "большое", "бомба", "борщ", "брат", "вера", "виза", "волна", "волрос", "вор", "воск", "восток", "вот", "вы", "гигант", "гитара", "гора", "город", "девочка", "дедушка", "дела", "день", "дети", "джаз", "диван", "до", "встречи", "дом", "друг", "дядя", "Ё", "моё", "евро", "ёж", "ёлка", "жара", "женщина", "жест", "жираф", "жюри", "зима", "зона", "зонт", "идея", "икра", "июль", "июнь", "йога", "йогурт", "как", "кактус", "карта", "кеды", "кино", "ключ", "кожа", "компьютер", "кот", "кофе", "кофта", "кто", "ладно", "лимон", "лист", "лицо", "ло", "свидания", "люди", "маг", "май", "мама", "март", "матч", "машина", "метро", "мода", "молоко", "москва", "мост", "мрак", "мужчина", "мука", "мы", "мясо", "норма", "нормално", "нос", "нота", "ноутбук", "окно", "очень", "приятно", "папа", "парк", "пожалуйста", "пока", "пончик", "попкорн", "порт", "рай", "рок", "ром", "рост", "рот", "рыба", "самолёт", "сахар", "сел", "семья", "слон", "сок", "спасибо", "сто", "стол", "сумка", "суп", "съел", "сыр", "так", "такси", "там", "театр", "товарищ", "том", "томат", "торт", "тоска", "трава", "трактор", "три", "ты", "ужас", "утро", "учитель", "факт", "фон", "хахахахах", "хор", "хорошо", "царапна", "цвет", "чай", "час", "чек", "шанс", "шок", "щека", "щи", "экзамен", "экономика", "это", "эхо", "юбка", "юг", "юмор", "юрист", "я", "я", "в", "порядке", "я", "плохо", "яблоко"] 
let board = create_board(lista_primeiro_semestre,10,2)
draw_table(board)
document.getElementById("next").addEventListener('click',generate)

function generate() {
    let n_words = document.getElementById("n_words").value
    let size = document.getElementById("size").value
    let board = create_board(lista_primeiro_semestre,size,n_words)
    draw_table(board)
}

function create_board(word_set, size, n_words) {
    return ws.run(word_set,size,n_words)
}

function draw_table(b) {
    let t = document.querySelector('table')
    let htmlContent = ""
    for (let i = 0; i < (b.size * b.size); i+=b.size) {
        let line = b.elements.slice(i,i+b.size)
        htmlContent += "<tr>"
        for (const elem of line) {
            htmlContent += "<td>" + elem + "</td>"
        }
        htmlContent += "</tr>"
    }
    t.innerHTML = htmlContent
}